experimental/glm52_b300_fixed_seq/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc32/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 320 --max-concurrency 32 --request-rate inf --ignore-eos --save-result --num-warmups 64 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc32 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.UUI5W5 ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.UUI5W5 -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 320 --max-concurrency 32 --request-rate inf --ignore-eos --save-result --num-warmups 64 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc32 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=320, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc32', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=64)
Generating 320 prompts using 8 worker processes...
Prompt generation completed in 6.5s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6567  max=8190  mean=7353.20  avg_token_mismatch=12.01 
 output_lens: min=819   max=1024  mean=925.45  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 64 requests...
100%|██████████| 64/64 [00:37<00:00,  1.69it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
  0%|          | 0/320 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 320/320 [02:52<00:00,  1.85it/s]
============ Serving Benchmark Result ============
Successful requests:                     320       
Benchmark duration (s):                  172.51    
Total input tokens:                      2353025   
Total generated tokens:                  296143    
Request throughput (req/s):              1.85      
Output token throughput (tok/s):         1716.64   
Total Token throughput (tok/s):          15356.33  
---------------Time to First Token----------------
Mean TTFT (ms):                          889.37    
Median TTFT (ms):                        350.85    
P90 TTFT (ms):                           1025.63   
P99 TTFT (ms):                           7496.37   
P99.9 TTFT (ms):                         12513.72  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.36     
Median TPOT (ms):                        17.74     
P90 TPOT (ms):                           20.43     
P99 TPOT (ms):                           24.28     
P99.9 TPOT (ms):                         25.97     
---------------Inter-token Latency----------------
Mean ITL (ms):                           1438.73   
Median ITL (ms):                         979.98    
P90 ITL (ms):                            3225.68   
P99 ITL (ms):                            6659.94   
P99.9 ITL (ms):                          8823.66   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          16944.66  
Median E2EL (ms):                        16896.09  
P90 E2EL (ms):                           20297.15  
P99 E2EL (ms):                           25339.01  
P99.9 E2EL (ms):                         29912.19  
==================================================
+ set +x